"""Скрипт для заполнения бд тестовыми кафедрами и связанными предметами"""
import asyncio

from server.src.database import async_session_maker
from server.src.models.department import Department
from server.src.models.subject import Subject

test_entries = {
    "Информатика и вычислительная техника": [
        "Алгоритмы и структуры данных",
        "Операционные системы",
        "Компьютерные сети",
        "Базы данных",
        "Искусственный интеллект",
        "Машинное обучение",
        "Теория вычислений"
    ],
    "Прикладная математика": [
        "Линейная алгебра",
        "Матанализ",
        "Дифференциальные уравнения",
        "Теория вероятностей",
        "Численные методы"
    ],
    "Прикладная физика": [
        "Квантовая механика",
        "Термодинамика",
        "Физика твердого тела",
        "Оптика"
    ],
    "Экономика": [
        "Микроэкономика",
        "Макроэкономика",
        "Эконометрика",
        "Финансовый учет",
        "Маркетинг"
    ],
    "Юриспруденция": [
        "Уголовное право",
        "Гражданское право",
        "Административное право",
        "Международное право",
        "Теория государства и права",
        "Правоохранительные органы"
    ],
    "Филология": [
        "Литературоведение",
        "Русский язык",
        "Стилистика",
        "Теория перевода",
        "История языка"
    ],
    "История": [
        "История Древнего мира",
        "История Средних веков",
        "История России",
        "Новейшая история",
        "Источниковедение"
    ],
    "Биотехнология": [
        "Молекулярная биология",
        "Генетика",
        "Микробиология",
        "Биохимия",
        "Клеточная инженерия",
        "Иммунология",
        "Экология"
    ],
    "Медицина": [
        "Анатомия",
        "Физиология",
        "Фармакология",
        "Патология",
        "Хирургия",
        "Педиатрия",
        "Кардиология",
        "Неврология",
        "Анестезиология"
    ],
    "Психология": [
        "Общая психология",
        "Социальная психология",
        "Клиническая психология",
        "Психодиагностика",
        "Возрастная психология"
    ]
}


async def create_test_data():
    async with async_session_maker() as session:
        async with session.begin():
            for dep, subjects in test_entries.items():
                department = Department(name=dep)
                department.subjects = [Subject(name=subject) for subject in subjects]
                session.add(department)


asyncio.run(create_test_data())
